In [1]:
import pandas as pd

In [35]:
df = pd.read_excel("Cal Nonprofits - Dental and Vision.xlsx", sheet_name='2025 11')
df = df.iloc[3:,[0,1,5,8]] # [ID, name, EE duct dental, EE duct vision]
df.columns = ["Id", "name","Dental EE","Vision EE"]
# df.columns = ['EEID','Name','Title','Site','Setal','Detal','Vision','Vision2',]
df.head(10)

      Id                   name Dental EE Vision EE
3   1729     Bandelaria, Evelyn         0         0
4   2247           Brown, Samar         0         0
5   2261  Caamal, Sasha Katrina    139.44     21.41
6   2081           Cai, Miley J    139.44     21.41
7   2274     Castillo, Marijane         0         0
8   1593           Chan, Lauren         0         0
9   2309   Chen, Clara Huihuang         0         0
10  2285          Chen, Jou-han         0         0
11  2131           Chen, Shuhua         0         0
12  1751           Chen, Xiu Er         0         0

In [36]:
k_df = df[df['Id'] == "2348"]
k_df

       Id                       name Dental EE Vision EE
72   2348  Rodriguez Madera, Krystal     52.79      8.92
140  2348  Rodriguez Madera, Krystal         0         0
141  2348  Rodriguez Madera, Krystal         0         0
142  2348  Rodriguez Madera, Krystal         0         0
143  2348  Rodriguez Madera, Krystal     52.79      8.92
144  2348  Rodriguez Madera, Krystal     52.79      8.92
145  2348  Rodriguez Madera, Krystal     52.79      8.92

In [37]:
data = k_df.copy()
data = data.drop_duplicates()
data

       Id                       name Dental EE Vision EE
72   2348  Rodriguez Madera, Krystal     52.79      8.92
140  2348  Rodriguez Madera, Krystal         0         0

In [38]:
data = k_df.copy()
data = (
    data
    .groupby("Id", as_index=False)
    .agg({
        "Dental EE": "sum",
        "Vision EE": "sum",
    })
)

data

     Id Dental EE Vision EE
0  2348    211.16     35.68